app/views/tasks/_form.html.erb

SELECT "task_lists".* FROM "task_lists"
---
    <%= f.label :task_list_id %><br>
    <%= f.collection_select :task_list_id, TaskList.all, :id, :name, prompt: true %>

SELECT "users".* FROM "users"
---
    <%= f.label :user_id %><br>
    <%= f.collection_select :user_id, User.all, :id, :username, prompt: "Assign task to user" %>