app/views/home/index.html.erb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
---
<% user = User.find_by_id(session[:user_id]) %>

SELECT "tasks".* FROM "tasks" WHERE "tasks"."user_id" = ?  [["user_id", 1]]
---
<ul>
	<% @user.tasks.each do |task| %>