app/controllers/login_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."username" = ? AND "users"."password" = ? LIMIT 1  [["username", "rtick"], ["password", "password"]]
---
  def authenticate
  	user = User.find_by(username: params[:username], password: params[:password])