app/controllers/tasks_controller.rb

INSERT INTO "tasks" ("title", "description", "is_complete_toggle", "due_date", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["title", ""], ["description", ""], ["is_complete_toggle", "f"], ["due_date", "2015-11-10"], ["created_at", "2015-11-10 19:26:23.613387"], ["updated_at", "2015-11-10 19:26:23.613387"]]
---
  def create
    @task = Task.new(task_params)

    respond_to do |format|
      if @task.save

UPDATE "tasks" SET "user_id" = ?, "updated_at" = ? WHERE "tasks"."id" = ?  [["user_id", 3], ["updated_at", "2015-12-17 00:20:07.340764"], ["id", 6]]
---
  def update
    respond_to do |format|
      if @task.update(task_params)