app/controllers/task_lists_controller.rb

SELECT "task_lists".* FROM "task_lists"
---
  def index
    @task_lists = TaskList.all

INSERT INTO "task_lists" ("name", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "test"], ["description", "test"], ["created_at", "2015-11-10 19:05:55.616054"], ["updated_at", "2015-11-10 19:05:55.616054"]]
---
  def create
    @task_list = TaskList.new(task_list_params)

    respond_to do |format|
      if @task_list.save

UPDATE "task_lists" SET "name" = ?, "description" = ?, "updated_at" = ? WHERE "task_lists"."id" = ?  [["name", "General"], ["description", "This is our general list"], ["updated_at", "2015-12-03 02:31:40.381917"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @task_list.update(task_list_params)

SELECT  "task_lists".* FROM "task_lists" WHERE "task_lists"."id" = ? LIMIT 1  [["id", 1]]
---
    def set_task_list
      @task_list = TaskList.find(params[:id])