app/views/task_lists/show.html.erb

<ul>
	<% @task_lists.tasks.each do |task|%>
---
SELECT "tasks".* FROM "tasks" WHERE "tasks"."task_list_id" = ?  [["task_list_id", 1]]